{
    "currentSemester": {
            "name": "Fall 2025",
            "talks": [
                {
                    "name": "Open! Sign up!",
                    "title": "TBD",
                    "abstract": "TBD",
                    "date": "12/03"
                },
                {
                    "name": "Kashif Khan",
                    "title": "TBD",
                    "abstract": "TBD",
                    "date": "11/19"
                },
                {
                    "name": "Dimas Sanjoyo",
                    "title": "TBD",
                    "abstract": "TBD",
                    "date": "11/12"
                },
                {
                    "name": "Will Legg",
                    "title": "TBD",
                    "abstract": "TBD",
                    "date": "11/05"
                },
                {
                    "name": "Jonathon Fleck",
                    "title": "TBD",
                    "abstract": "TBD",
                    "date": "10/29"
                },
                {
                    "name": "Ethan Morgan",
                    "title": "TBD",
                    "abstract": "TBD",
                    "date": "10/22"
                },
                {
                    "name": "Gari Chua",
                    "title": "A Gentle Introduction to the Minimal Model Program",
                    "abstract": "Birational geometry is the study of classifying algebraic varieties up to birational equivalence. To perform such a classification, one first needs to find a \"nice\" representative of each birational equivalence class. This representative is the minimal model. The Minimal Model Program seeks to produce a minimal model out of a smooth projective variety via a series of contractions, which are birational maps similar to blowups. In this talk, I will relay the history of the development of the Minimal Model Program and its various variants, from the classical case of curves and surfaces in the early-to-mid 90s, to the recent modern machinery. This talk will focus less on the technical details and more on motivation and story-telling.",
                    "date": "10/15"
                },
                {
                    "name": "Joseph Sullivan",
                    "title": "Some Ingredients Towards the Hilbert Scheme",
                    "abstract": "Pic-king up where Brian left us, I will continue with some gentle introduction to moduli. We won't have time to go into all the details about constructing the Hilbert scheme, but I will sketch some of its ingredients. We will start with the moduli description of the Grassmannian, and work our way towards embedding the Hilbert scheme (the moduli space of subschemes of P^n with a fixed Hilbert polynomial) inside an appropriate Grassmannian using Castelnuovo-Mumford regularity.",
                    "date": "10/01"
                },
                {
                    "name": "Liebo Pan",
                    "title": "Quantum Cohomology and Kontsevich’s recursive formula",
                    "abstract": "A classical problem in enumerative geometry is to determine the number, N_d​, of rational plane curves of degree d passing through 3d−1 points in general position. This question remained largely intractable for decades, with only the first five values (N_1​ through N_5​) known before the 1990s. A revolutionary breakthrough came from Maxim Kontsevich who, inspired by string theory, uncovered a deep connection between this enumerative problem and the structure of quantum cohomology.\n\nThis talk will introduce the foundational concepts needed to understand Kontsevich's solution. We will begin by discussing the moduli spaces of stable curves and stable maps, which provide the geometric setting for modern enumerative problems. We will then see how intersection theory on these spaces gives rise to Gromov-Witten invariants—the precise tool for \"counting\" curves.\n\nTo compute these invariants, we will introduce the algebraic framework of quantum cohomology and its generating function, the Gromov-Witten potential. The associativity of the quantum product imposes a powerful constraint known as the WDVV (Witten-Dijkgraaf-Verlinde-Verlinde) equation. Ultimately, we will demonstrate how this equation yields Kontsevich's celebrated recursive formula, which allows for the systematic computation of all the numbers N_d​.",
                    "date": "09/24"
                },
                {
                    "name": "Rahul Ajit",
                    "title": "Singularities of The Blow-up Algebras",
                    "abstract": "Blow-ups are basic geometric transformations that replace a point (or a subspace) by all possible tangent directions. Any birational map can be written as a composition of simpler maps given by blow-ups. Hironaka’s foundational result on the Resolution of Singularities uses a careful sequence of blow-ups to make a variety smooth. Therefore, it is important to understand how ”good” singularities behave under blow-ups. I will answer this question in generality for (F-) rational singularities by describing explicitly the test/multiplier module (a measure of this singularity). In particular, this answers a conjecture of Hara-Watanabe-Yoshida (2002), giving a quick proof of the discreteness and rationality of (F-) jumping numbers and provides a hands-on way to compute test ideals for non-principal ideals by computer (as predicted by Schwede-Tucker). Time permitting, I'll mention a couple of future directions. Part of this work is joint with Hunter Simper.",
                    "date": "09/17"
                },
                {
                    "name": "Zach Mere",
                    "title": "The change-of-variables formula in motivic integration",
                    "abstract": "Kontsevich introduced motivic integration to prove that birational complex Calabi-Yau manifolds have the same Hodge numbers. The proof uses a change-of-variables formula which assumes the varieties involved are smooth. In this talk, we'll discuss generalizations of this formula to the case where singularities are allowed. Then we'll deduce a result about Calabi-Yau varieties over an arbitrary field.",
                    "date": "09/10"
                },
                {
                    "name": "Daniel Apsley",
                    "title": "The Construction of the Weighted CM Line Bundle",
                    "abstract": "In this talk, we will outline the construction of the weighted CM Line bundle. The CM (Chow-Mumford) line bundle is a naturally defined (Q-)line bundle on the base of families of Fano varieties. This then defines an ample line bundle on the moduli space of K-polystable varieties, making this moduli space a projective variety. The weighted CM line bundle is an extension of this to a \"weighted\" version of K-stability, where the weight  is simply a positive continuous function on a certain polytope. To make this construction precise, we will use the Stone-Weierstrass theorem.",
                    "date": "09/07"
                },
                {
                    "name": "Brian Nugent",
                    "title": "The Picard Scheme",
                    "abstract": "The set of all line bundles on a variety form a group known as the Picard group. Like with many objects in algebraic geometry, the Picard group can be given a scheme structure in which it parametrizes families of line bundles on X, this is called the Picard scheme. In this talk, we will discuss the basic properties of the Picard scheme like its dimension, smoothness, connected components and maybe even show it has a connection to the name of this seminar.",
                    "date": "08/27"
                }
            ]
        },
    "semesters": [
        {
            "name": "Spring 2025",
            "talks": [
                {
                    "name": "Will Legg",
                    "title": "A Friendly Introduction to Witt Vectors",
                    "abstract": "Witt vectors arise naturally in modern mathematics, appearing in both algebraic and number-theoretic contexts. For example, in motivic integration, Witt vectors show up as the A-valued points of certain generalized jet schemes on p-adic varieties. In this introductory talk, we'll spend our time introducing Witt vectors and their operations, as well as some natural functorial properties which arise. Bring a notebook— we'll work through a few computations together! Only a passing familiarity with the language of schemes is assumed.",
                    "date": "04/09"
                },
                {
                    "name": "Joseph Sullivan",
                    "title": "Beilinson's Resolution of the Diagonal",
                    "abstract": "On P^n x P^n, we will write down a locally free resolution of the structure sheaf of the diagonal. This modest resolution then has astounding consequences for the derived category D^b(P^n)--we will explore as many implications as we have time. In particular, we will find a full strong exceptional collection (essentially an orthorgonal basis) for D^b(P^n), and we will use this to get a derived equivalence to bound quiver representations.",
                    "date": "04/02"
                },
                {
                    "name": "Qingyuan Xue",
                    "title": "Quasi-Log Schemes in Birational Geometry",
                    "abstract": "Quasi-log schemes, which generalize the concept of pairs, play a crucial role in birational geometry, particularly in the study of the Minimal Model Program (MMP) for pairs that may not be log canonical. In this talk, I will begin by reviewing fundamental definitions in birational geometry. I will then introduce quasi-log schemes, highlighting their key properties and similarities to usual pairs. If time permits, I will discuss the MMP in the context of quasi-log schemes.",
                    "date": "03/26"
                },
                {
                    "name": "Gari Chua",
                    "title": "Continued Fractions and Resolutions of Singularities of Affine Toric Surfaces",
                    "abstract": "An affine toric surface is an irreducible surface containing a 2-dimensional complex torus, and such that the natural action of the torus on itself extends to an action on the entire surface. Affine toric varieties can be described combinatorially in terms of polyhedral cones and fans. In this talk, we will explore the link between certain continued fraction expansions and resolutions of singularities of toric surfaces. In particular, we will see that for toric surfaces obtained from cones in certain forms, that computing a continued fraction expansion results in a series of blowups on the toric surface that constitute a resolution of singularities. We focus on explicit computations.",
                    "date": "03/19"
                },
                {
                    "name": "Jonathon Fleck",
                    "title": "Rationality, Cremona Groups, and Singularities of Fano Varieties ",
                    "abstract": "A variety is said to be rational if it is birational to some projective space. A common strategy showing a variety is not rational is naturally to show one of its birational invariants differ from that of projective space. In this talk, I will focus on a theorem of Iskovskikh and Manin which disproves rationality of smooth quartic threefolds in P4. I will start with its inspiration, a proof of Noether's theorem on the structure of the Cremona group of P2, discuss a low dimensional case which is similar in spirit to the case of quartic threefolds, and mention how these ideas generalize to higher dimensions using singularities. ",
                    "date": "02/26"
                },
                {
                    "name": "Jack Cook",
                    "title": "Algebraic Geometry in Representation Theory Part 2: The Nilpotent Cone, Perverse Coherent Sheaves, and the Lusztig-Vogan Bijection.",
                    "abstract": "Given the geometric nature of the previous talk, we now want to see how this can be abused to obtain novel results about representations. Lusztig and Vogan independently conjectured the existence of a certain bijection between representations of a maximal compact subgroup and certain geometric data. The first proof was done for complex groups by Bezrukavnikov using an idea of Deligne. We will go over the structure theory of the nilpotent cone and how Bezrukavnikov proved his result. Time permitting we will talk about generalizations of his result and techniques being used to compute this abstract bijection.",
                    "date": "02/19"
                },
                {
                    "name": "Jack Cook",
                    "title": "Algebraic Geometry in Representation Theory Part 1: Real reductive groups, the Borel-Weil-Bott theorem, and Localization Theory. ",
                    "abstract": "Representation theory has taken a rather geometric turn in the past 30 years. This started however with Borel and Weil in the 1950s. They first gave a geometric realization of irreducible representations of a compact Lie group. Over the years since then, other geometric techniques have been developed. We will discuss the history of this geometric advancement and see how one uses them to study representations. ",
                    "date": "02/12"
                },
                {
                    "name": "Zach Mere",
                    "title": "Differentials on arc spaces",
                    "abstract": "In this talk, we'll describe the sheaves of Kähler differentials of the arc space and jet schemes. The resulting formulas can be applied to derive new results and simplify the proofs of some theorems in the literature. We'll start by briefly reviewing some of the basic definitions and facts in the theory of arc spaces, then we'll compute several examples.",
                    "date": "02/05"
                },
                {
                    "name": "Daniel Apsley",
                    "title": "Quotients in Algebraic Geometry",
                    "abstract": "Quotients, or understanding the geometry of orbits of a given group action, is an important concept in geometry. In this talk, I want to discuss the problem of constructing quotients in algebraic geometry by reviewing which quotients can be constructed as schemes via GIT, and concluding with some generalities on algebraic spaces and stacks, to show that these abstract notions provide a more convenient framework for this problem. ",
                    "date": "01/22"
                },
                {
                    "name": "Rahul Ajit",
                    "title": "A survey on Vanishing theorems in Birational Geometry.",
                    "abstract": "After giving motivation for why should one care about Vanishing theorems of cohomology groups, I'll survey major vanishing results appearing ubiquitously in birational geometry over complex numbers. As I want to make this talk very accessible, I won't give any detailed proof.",
                    "date": "01/15"
                }
            ]
        }
    ]
}